SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_adc.h
/**
  * @brief ADC_ANY_CR Register Bit Definition
  */
#define  ADC_ANY_CR_CHANY_MDEN_Pos                (0)
#define  ADC_ANY_CR_CHANY_MDEN_Msk                (0x1U << ADC_ANY_CR_CHANY_MDEN_Pos)               /*!<Any Channel Mode Enable*/
#define  ADC_ANY_CR_CHANY_MDEN                    ADC_ANY_CR_CHANY_MDEN_Msk
#define  ADC_ANY_CR_JCEN_Pos                      (1)
#define  ADC_ANY_CR_JCEN_Msk                      (0x1U << ADC_ANY_CR_JCEN_Pos)                     /*!<Conversion Enable for Injected Channels*/
#define  ADC_ANY_CR_JCEN                          ADC_ANY_CR_JCEN_Msk
#define  ADC_ANY_CR_JEOSMPIE_Pos                  (2)
#define  ADC_ANY_CR_JEOSMPIE_Msk                  (0x1U << ADC_ANY_CR_JEOSMPIE_Pos)                 /*!<Interrupt Enable for JEOSAMP*/
#define  ADC_ANY_CR_JEOSMPIE                      ADC_ANY_CR_JEOSMPIE_Msk
#define  ADC_ANY_CR_JEOCIE_Pos                    (3)
#define  ADC_ANY_CR_JEOCIE_Msk                    (0x1U << ADC_ANY_CR_JEOCIE_Pos)                   /*!<Interrupt Enable for JEOC*/
#define  ADC_ANY_CR_JEOCIE                        ADC_ANY_CR_JEOCIE_Msk
#define  ADC_ANY_CR_JEOSIE_Pos                    (4)
#define  ADC_ANY_CR_JEOSIE_Msk                    (0x1U << ADC_ANY_CR_JEOSIE_Pos)                   /*!<Interrupt Enable for JEOS*/
#define  ADC_ANY_CR_JEOSIE                        ADC_ANY_CR_JEOSIE_Msk
#define  ADC_ANY_CR_JAUTO_Pos                     (5)
#define  ADC_ANY_CR_JAUTO_Msk                     (0x1U << ADC_ANY_CR_JAUTO_Pos)                    /*!<Automatic Injected Conversion*/
#define  ADC_ANY_CR_JAUTO                         ADC_ANY_CR_JAUTO_Msk
#define  ADC_ANY_CR_JADST_Pos                     (6)
#define  ADC_ANY_CR_JADST_Msk                     (0x1U << ADC_ANY_CR_JADST_Pos)                    /*!<ADC Start for Injected Channels*/
#define  ADC_ANY_CR_JADST                         ADC_ANY_CR_JADST_Msk
#define  ADC_ANY_CR_JTRGEN_Pos                    (7)
#define  ADC_ANY_CR_JTRGEN_Msk                    (0x1U << ADC_ANY_CR_JTRGEN_Pos)                   /*!<External Hardware Trigger Enable For Injected Channels*/
#define  ADC_ANY_CR_JTRGEN                        ADC_ANY_CR_JTRGEN_Msk
#define  ADC_ANY_CR_JTRGSEL_Pos                   (8)
#define  ADC_ANY_CR_JTRGSEL_Msk                   (0x1FU << ADC_ANY_CR_JTRGSEL_Pos)                 /*!<ADC External Trigger Sources Selection For Injected Channel*/
#define  ADC_ANY_CR_JTRGSEL                       ADC_ANY_CR_JTRGSEL_Msk
#define  ADC_ANY_CR_JTRGSEL_0                     (0x01U << ADC_ANY_CR_JTRGSEL_Pos) 
#define  ADC_ANY_CR_JTRGSEL_1                     (0x02U << ADC_ANY_CR_JTRGSEL_Pos) 
#define  ADC_ANY_CR_JTRGSEL_2                     (0x04U << ADC_ANY_CR_JTRGSEL_Pos) 
#define  ADC_ANY_CR_JTRGSEL_3                     (0x08U << ADC_ANY_CR_JTRGSEL_Pos) 
#define  ADC_ANY_CR_JTRGSEL_4                     (0x10U << ADC_ANY_CR_JTRGSEL_Pos) 
#define  ADC_ANY_CR_JTRGSHIFT_Pos                 (13)
#define  ADC_ANY_CR_JTRGSHIFT_Msk                 (0x7U << ADC_ANY_CR_JTRGSHIFT_Pos)                /*!<External Trigger Shift Sample for Injected Channels*/
#define  ADC_ANY_CR_JTRGSHIFT                     ADC_ANY_CR_JTRGSHIFT_Msk
#define  ADC_ANY_CR_JTRGSHIFT_0                   (0x1U << ADC_ANY_CR_JTRGSHIFT_Pos) 
#define  ADC_ANY_CR_JTRGSHIFT_1                   (0x2U << ADC_ANY_CR_JTRGSHIFT_Pos) 
#define  ADC_ANY_CR_JTRGSHIFT_2                   (0x4U << ADC_ANY_CR_JTRGSHIFT_Pos) 
#define  ADC_ANY_CR_JTRG_EDGE_Pos                 (16)
#define  ADC_ANY_CR_JTRG_EDGE_Msk                 (0x3U << ADC_ANY_CR_JTRG_EDGE_Pos)                /*!<External Trigger sources Edge Selection for Injected Channels*/
#define  ADC_ANY_CR_JTRG_EDGE                     ADC_ANY_CR_JTRG_EDGE_Msk
#define  ADC_ANY_CR_JTRG_EDGE_0                   (0x1U << ADC_ANY_CR_JTRG_EDGE_Pos) 
#define  ADC_ANY_CR_JTRG_EDGE_1                   (0x2U << ADC_ANY_CR_JTRG_EDGE_Pos) 

/**
  * @brief ADC_SMPR1 Register Bit Definition
  */
#define  ADC_SMPR1_SAMP0_Pos                      (0)
#define  ADC_SMPR1_SAMP0_Msk                      (0xFU << ADC_SMPR1_SAMP0_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP0                          ADC_SMPR1_SAMP0_Msk
#define  ADC_SMPR1_SAMP0_0                        (0x1U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_1                        (0x2U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_2                        (0x4U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP0_3                        (0x8U << ADC_SMPR1_SAMP0_Pos) 
#define  ADC_SMPR1_SAMP1_Pos                      (4)
#define  ADC_SMPR1_SAMP1_Msk                      (0xFU << ADC_SMPR1_SAMP1_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP1                          ADC_SMPR1_SAMP1_Msk
#define  ADC_SMPR1_SAMP1_0                        (0x1U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_1                        (0x2U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_2                        (0x4U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP1_3                        (0x8U << ADC_SMPR1_SAMP1_Pos) 
#define  ADC_SMPR1_SAMP2_Pos                      (8)
#define  ADC_SMPR1_SAMP2_Msk                      (0xFU << ADC_SMPR1_SAMP2_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP2                          ADC_SMPR1_SAMP2_Msk
#define  ADC_SMPR1_SAMP2_0                        (0x1U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_1                        (0x2U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_2                        (0x4U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP2_3                        (0x8U << ADC_SMPR1_SAMP2_Pos) 
#define  ADC_SMPR1_SAMP3_Pos                      (12)
#define  ADC_SMPR1_SAMP3_Msk                      (0xFU << ADC_SMPR1_SAMP3_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP3                          ADC_SMPR1_SAMP3_Msk
#define  ADC_SMPR1_SAMP3_0                        (0x1U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_1                        (0x2U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_2                        (0x4U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP3_3                        (0x8U << ADC_SMPR1_SAMP3_Pos) 
#define  ADC_SMPR1_SAMP4_Pos                      (16)
#define  ADC_SMPR1_SAMP4_Msk                      (0xFU << ADC_SMPR1_SAMP4_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP4                          ADC_SMPR1_SAMP4_Msk
#define  ADC_SMPR1_SAMP4_0                        (0x1U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_1                        (0x2U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_2                        (0x4U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP4_3                        (0x8U << ADC_SMPR1_SAMP4_Pos) 
#define  ADC_SMPR1_SAMP5_Pos                      (20)
#define  ADC_SMPR1_SAMP5_Msk                      (0xFU << ADC_SMPR1_SAMP5_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP5                          ADC_SMPR1_SAMP5_Msk
#define  ADC_SMPR1_SAMP5_0                        (0x1U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_1                        (0x2U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_2                        (0x4U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP5_3                        (0x8U << ADC_SMPR1_SAMP5_Pos) 
#define  ADC_SMPR1_SAMP6_Pos                      (24)
#define  ADC_SMPR1_SAMP6_Msk                      (0xFU << ADC_SMPR1_SAMP6_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP6                          ADC_SMPR1_SAMP6_Msk
#define  ADC_SMPR1_SAMP6_0                        (0x1U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_1                        (0x2U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_2                        (0x4U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP6_3                        (0x8U << ADC_SMPR1_SAMP6_Pos) 
#define  ADC_SMPR1_SAMP7_Pos                      (28)
#define  ADC_SMPR1_SAMP7_Msk                      (0xFU << ADC_SMPR1_SAMP7_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR1_SAMP7                          ADC_SMPR1_SAMP7_Msk
#define  ADC_SMPR1_SAMP7_0                        (0x1U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_1                        (0x2U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_2                        (0x4U << ADC_SMPR1_SAMP7_Pos) 
#define  ADC_SMPR1_SAMP7_3                        (0x8U << ADC_SMPR1_SAMP7_Pos) 

/**
  * @brief ADC_SMPR2 Register Bit Definition
  */
#define  ADC_SMPR2_SAMP8_Pos                      (0)
#define  ADC_SMPR2_SAMP8_Msk                      (0xFU << ADC_SMPR2_SAMP8_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP8                          ADC_SMPR2_SAMP8_Msk
#define  ADC_SMPR2_SAMP8_0                        (0x1U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_1                        (0x2U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_2                        (0x4U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP8_3                        (0x8U << ADC_SMPR2_SAMP8_Pos) 
#define  ADC_SMPR2_SAMP9_Pos                      (4)
#define  ADC_SMPR2_SAMP9_Msk                      (0xFU << ADC_SMPR2_SAMP9_Pos)                     /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP9                          ADC_SMPR2_SAMP9_Msk
#define  ADC_SMPR2_SAMP9_0                        (0x1U << ADC_SMPR2_SAMP9_Pos) 
#define  ADC_SMPR2_SAMP9_1                        (0x2U << ADC_SMPR2_SAMP9_Pos) 
#define  ADC_SMPR2_SAMP9_2                        (0x4U << ADC_SMPR2_SAMP9_Pos) 
#define  ADC_SMPR2_SAMP9_3                        (0x8U << ADC_SMPR2_SAMP9_Pos) 
#define  ADC_SMPR2_SAMP10_Pos                     (8)
#define  ADC_SMPR2_SAMP10_Msk                     (0xFU << ADC_SMPR2_SAMP10_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP10                         ADC_SMPR2_SAMP10_Msk
#define  ADC_SMPR2_SAMP10_0                       (0x1U << ADC_SMPR2_SAMP10_Pos) 
#define  ADC_SMPR2_SAMP10_1                       (0x2U << ADC_SMPR2_SAMP10_Pos) 
#define  ADC_SMPR2_SAMP10_2                       (0x4U << ADC_SMPR2_SAMP10_Pos) 
#define  ADC_SMPR2_SAMP10_3                       (0x8U << ADC_SMPR2_SAMP10_Pos) 
#define  ADC_SMPR2_SAMP11_Pos                     (12)
#define  ADC_SMPR2_SAMP11_Msk                     (0xFU << ADC_SMPR2_SAMP11_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP11                         ADC_SMPR2_SAMP11_Msk
#define  ADC_SMPR2_SAMP11_0                       (0x1U << ADC_SMPR2_SAMP11_Pos) 
#define  ADC_SMPR2_SAMP11_1                       (0x2U << ADC_SMPR2_SAMP11_Pos) 
#define  ADC_SMPR2_SAMP11_2                       (0x4U << ADC_SMPR2_SAMP11_Pos) 
#define  ADC_SMPR2_SAMP11_3                       (0x8U << ADC_SMPR2_SAMP11_Pos) 
#define  ADC_SMPR2_SAMP12_Pos                     (16)
#define  ADC_SMPR2_SAMP12_Msk                     (0xFU << ADC_SMPR2_SAMP12_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP12                         ADC_SMPR2_SAMP12_Msk
#define  ADC_SMPR2_SAMP12_0                       (0x1U << ADC_SMPR2_SAMP12_Pos) 
#define  ADC_SMPR2_SAMP12_1                       (0x2U << ADC_SMPR2_SAMP12_Pos) 
#define  ADC_SMPR2_SAMP12_2                       (0x4U << ADC_SMPR2_SAMP12_Pos) 
#define  ADC_SMPR2_SAMP12_3                       (0x8U << ADC_SMPR2_SAMP12_Pos) 
#define  ADC_SMPR2_SAMP13_Pos                     (20)
#define  ADC_SMPR2_SAMP13_Msk                     (0xFU << ADC_SMPR2_SAMP13_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP13                         ADC_SMPR2_SAMP13_Msk
#define  ADC_SMPR2_SAMP13_0                       (0x1U << ADC_SMPR2_SAMP13_Pos) 
#define  ADC_SMPR2_SAMP13_1                       (0x2U << ADC_SMPR2_SAMP13_Pos) 
#define  ADC_SMPR2_SAMP13_2                       (0x4U << ADC_SMPR2_SAMP13_Pos) 
#define  ADC_SMPR2_SAMP13_3                       (0x8U << ADC_SMPR2_SAMP13_Pos) 
#define  ADC_SMPR2_SAMP14_Pos                     (24)
#define  ADC_SMPR2_SAMP14_Msk                     (0xFU << ADC_SMPR2_SAMP14_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP14                         ADC_SMPR2_SAMP14_Msk
#define  ADC_SMPR2_SAMP14_0                       (0x1U << ADC_SMPR2_SAMP14_Pos) 
#define  ADC_SMPR2_SAMP14_1                       (0x2U << ADC_SMPR2_SAMP14_Pos) 
#define  ADC_SMPR2_SAMP14_2                       (0x4U << ADC_SMPR2_SAMP14_Pos) 
#define  ADC_SMPR2_SAMP14_3                       (0x8U << ADC_SMPR2_SAMP14_Pos) 
#define  ADC_SMPR2_SAMP15_Pos                     (28)
#define  ADC_SMPR2_SAMP15_Msk                     (0xFU << ADC_SMPR2_SAMP15_Pos)                    /*!<Sample Time Selection*/
#define  ADC_SMPR2_SAMP15                         ADC_SMPR2_SAMP15_Msk
#define  ADC_SMPR2_SAMP15_0                       (0x1U << ADC_SMPR2_SAMP15_Pos) 
#define  ADC_SMPR2_SAMP15_1                       (0x2U << ADC_SMPR2_SAMP15_Pos) 
#define  ADC_SMPR2_SAMP15_2                       (0x4U << ADC_SMPR2_SAMP15_Pos) 
#define  ADC_SMPR2_SAMP15_3                       (0x8U << ADC_SMPR2_SAMP15_Pos) 

/**
  * @brief ADC_JOFR Register Bit Definition
  */
#define  ADC_JOFR_JOFFSET_Pos                     (0)
#define  ADC_JOFR_JOFFSET_Msk                     (0xFFFU << ADC_JOFR_JOFFSET_Pos)                  /*!<Data Offset Register for 12-bit AD Injected Channeln*/
#define  ADC_JOFR_JOFFSET                         ADC_JOFR_JOFFSET_Msk
#define  ADC_JOFR_JOFFSET_0                       (0x001U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_1                       (0x002U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_2                       (0x004U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_3                       (0x008U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_4                       (0x010U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_5                       (0x020U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_6                       (0x040U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_7                       (0x080U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_8                       (0x100U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_9                       (0x200U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_10                      (0x400U << ADC_JOFR_JOFFSET_Pos) 
#define  ADC_JOFR_JOFFSET_11                      (0x800U << ADC_JOFR_JOFFSET_Pos) 

/**
  * @brief ADC_JSQR Register Bit Definition
  */
#define  ADC_JSQR_JSQ0_Pos                        (0)
#define  ADC_JSQR_JSQ0_Msk                        (0x1FU << ADC_JSQR_JSQ0_Pos)                      /*!<0th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ0                            ADC_JSQR_JSQ0_Msk
#define  ADC_JSQR_JSQ0_0                          (0x01U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_1                          (0x02U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_2                          (0x04U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_3                          (0x08U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ0_4                          (0x10U << ADC_JSQR_JSQ0_Pos) 
#define  ADC_JSQR_JSQ1_Pos                        (5)
#define  ADC_JSQR_JSQ1_Msk                        (0x1FU << ADC_JSQR_JSQ1_Pos)                      /*!<1th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ1                            ADC_JSQR_JSQ1_Msk
#define  ADC_JSQR_JSQ1_0                          (0x01U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_1                          (0x02U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_2                          (0x04U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_3                          (0x08U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ1_4                          (0x10U << ADC_JSQR_JSQ1_Pos) 
#define  ADC_JSQR_JSQ2_Pos                        (10)
#define  ADC_JSQR_JSQ2_Msk                        (0x1FU << ADC_JSQR_JSQ2_Pos)                      /*!<2th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ2                            ADC_JSQR_JSQ2_Msk
#define  ADC_JSQR_JSQ2_0                          (0x01U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_1                          (0x02U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_2                          (0x04U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_3                          (0x08U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ2_4                          (0x10U << ADC_JSQR_JSQ2_Pos) 
#define  ADC_JSQR_JSQ3_Pos                        (15)
#define  ADC_JSQR_JSQ3_Msk                        (0x1FU << ADC_JSQR_JSQ3_Pos)                      /*!<3th Conversion for Injected Sequence*/
#define  ADC_JSQR_JSQ3                            ADC_JSQR_JSQ3_Msk
#define  ADC_JSQR_JSQ3_0                          (0x01U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_1                          (0x02U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_2                          (0x04U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_3                          (0x08U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JSQ3_4                          (0x10U << ADC_JSQR_JSQ3_Pos) 
#define  ADC_JSQR_JNUM_Pos                        (20)
#define  ADC_JSQR_JNUM_Msk                        (0x3U << ADC_JSQR_JNUM_Pos)                       /*!<Channel Number for Injected Sequence*/
#define  ADC_JSQR_JNUM                            ADC_JSQR_JNUM_Msk
#define  ADC_JSQR_JNUM_0                          (0x1U << ADC_JSQR_JNUM_Pos) 
#define  ADC_JSQR_JNUM_1                          (0x2U << ADC_JSQR_JNUM_Pos) 

/**
  * @brief ADC_JADDATA Register Bit Definition
  */
#define  ADC_JADDATA_JDATA_Pos                    (0)
#define  ADC_JADDATA_JDATA_Msk                    (0xFFFFU << ADC_JADDATA_JDATA_Pos)                /*!<12-bit A/D conversion result of current injected channel.*/
#define  ADC_JADDATA_JDATA                        ADC_JADDATA_JDATA_Msk
#define  ADC_JADDATA_JDATA_0                      (0x0001U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_1                      (0x0002U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_2                      (0x0004U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_3                      (0x0008U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_4                      (0x0010U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_5                      (0x0020U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_6                      (0x0040U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_7                      (0x0080U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_8                      (0x0100U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_9                      (0x0200U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_10                     (0x0400U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_11                     (0x0800U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_12                     (0x1000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_13                     (0x2000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_14                     (0x4000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JDATA_15                     (0x8000U << ADC_JADDATA_JDATA_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_Pos              (16)
#define  ADC_JADDATA_JCHANNELSEL_Msk              (0xFU << ADC_JADDATA_JCHANNELSEL_Pos)             /*!<4 bits show the injected channel corresponding to the current data (Injected Channel Selection)*/
#define  ADC_JADDATA_JCHANNELSEL                  ADC_JADDATA_JCHANNELSEL_Msk
#define  ADC_JADDATA_JCHANNELSEL_0                (0x1U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_1                (0x2U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_2                (0x4U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JCHANNELSEL_3                (0x8U << ADC_JADDATA_JCHANNELSEL_Pos) 
#define  ADC_JADDATA_JOVERRUN_Pos                 (21)
#define  ADC_JADDATA_JOVERRUN_Msk                 (0x1U << ADC_JADDATA_JOVERRUN_Pos)                /*!<Overrun Flag for Injected Channels (read-only)*/
#define  ADC_JADDATA_JOVERRUN                     ADC_JADDATA_JOVERRUN_Msk
#define  ADC_JADDATA_JVALID_Pos                   (22)
#define  ADC_JADDATA_JVALID_Msk                   (0x1U << ADC_JADDATA_JVALID_Pos)                  /*!<Valid Flag for Injected Channels (read-only)*/
#define  ADC_JADDATA_JVALID                       ADC_JADDATA_JVALID_Msk

/**
  * @brief ADC_JDR Register Bit Definition
  */
#define  ADC_JDR_JDATA_Pos                        (0)
#define  ADC_JDR_JDATA_Msk                        (0xFFFFU << ADC_JDR_JDATA_Pos)                    /*!<Conversion result of A/D injected channel n*/
#define  ADC_JDR_JDATA                            ADC_JDR_JDATA_Msk
#define  ADC_JDR_JDATA_0                          (0x0001U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_1                          (0x0002U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_2                          (0x0004U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_3                          (0x0008U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_4                          (0x0010U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_5                          (0x0020U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_6                          (0x0040U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_7                          (0x0080U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_8                          (0x0100U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_9                          (0x0200U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_10                         (0x0400U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_11                         (0x0800U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_12                         (0x1000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_13                         (0x2000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_14                         (0x4000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JDATA_15                         (0x8000U << ADC_JDR_JDATA_Pos) 
#define  ADC_JDR_JOVERRUN_Pos                     (21)
#define  ADC_JDR_JOVERRUN_Msk                     (0x1U << ADC_JDR_JOVERRUN_Pos)                    /*!<Overrun Flag for Injected Channels*/
#define  ADC_JDR_JOVERRUN                         ADC_JDR_JOVERRUN_Msk
#define  ADC_JDR_JVALID_Pos                       (22)
#define  ADC_JDR_JVALID_Msk                       (0x1U << ADC_JDR_JVALID_Pos)                      /*!<Valid Flag for Injected Channels*/
#define  ADC_JDR_JVALID                           ADC_JDR_JVALID_Msk

