SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_adc.h
/**
  * @brief ADC_LDATA Register Bit Definition
  */
#define  ADC_LDATA_LDATA_Pos                      (0)
#define  ADC_LDATA_LDATA_Msk                      (0xFFFFU << ADC_LDATA_LDATA_Pos)                  /*!<Last Conversion Data*/
#define  ADC_LDATA_LDATA                          ADC_LDATA_LDATA_Msk
#define  ADC_LDATA_LDATA_0                        (0x0001U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_1                        (0x0002U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_2                        (0x0004U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_3                        (0x0008U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_4                        (0x0010U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_5                        (0x0020U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_6                        (0x0040U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_7                        (0x0080U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_8                        (0x0100U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_9                        (0x0200U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_10                       (0x0400U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_11                       (0x0800U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_12                       (0x1000U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_13                       (0x2000U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_14                       (0x4000U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LDATA_15                       (0x8000U << ADC_LDATA_LDATA_Pos) 
#define  ADC_LDATA_LCHANNELSEL_Pos                (16)
#define  ADC_LDATA_LCHANNELSEL_Msk                (0xFU << ADC_LDATA_LCHANNELSEL_Pos)               /*!<Last Channel Selection*/
#define  ADC_LDATA_LCHANNELSEL                    ADC_LDATA_LCHANNELSEL_Msk
#define  ADC_LDATA_LCHANNELSEL_0                  (0x1U << ADC_LDATA_LCHANNELSEL_Pos) 
#define  ADC_LDATA_LCHANNELSEL_1                  (0x2U << ADC_LDATA_LCHANNELSEL_Pos) 
#define  ADC_LDATA_LCHANNELSEL_2                  (0x4U << ADC_LDATA_LCHANNELSEL_Pos) 
#define  ADC_LDATA_LCHANNELSEL_3                  (0x8U << ADC_LDATA_LCHANNELSEL_Pos) 
#define  ADC_LDATA_LOVERRUN_Pos                   (20)
#define  ADC_LDATA_LOVERRUN_Msk                   (0x1U << ADC_LDATA_LOVERRUN_Pos)                  /*!<Overrun Flag*/
#define  ADC_LDATA_LOVERRUN                       ADC_LDATA_LOVERRUN_Msk
#define  ADC_LDATA_LVALID_Pos                     (21)
#define  ADC_LDATA_LVALID_Msk                     (0x1U << ADC_LDATA_LVALID_Pos)                    /*!<Valid Flag*/
#define  ADC_LDATA_LVALID                         ADC_LDATA_LVALID_Msk

#endif

